# ShouldAdjustWallParameters Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..WallFailures..::..ShouldAdjustWallParameters Property
BuiltInFailures..::..WallFailures Class See Also
---
The best way to control top and base of the Wall is to modify the Constraints and Offset Parameters in Properties dialog.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ShouldAdjustWallParameters { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ShouldAdjustWallParameters As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ShouldAdjustWallParameters {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..WallFailures Class
Autodesk.Revit.DB Namespace